airFoil2D/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class volVectorField;
    object U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (9.96 0.87 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (9.96 0.87 0);
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type slip;
    }

    bottom
    {
        type slip;
    }

    airfoil
    {
        type noSlip;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}
