airFoil2D/0/nuTilda
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 1e-5;
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type zeroGradient;
    }

    bottom
    {
        type zeroGradient;
    }

    airfoil
    {
        type fixedValue;
        value uniform 0;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}
