airFoil2D/0/nut
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0;
    }

    outlet
    {
        type calculated;
        value uniform 0;
    }

    top
    {
        type calculated;
        value uniform 0;
    }

    bottom
    {
        type calculated;
        value uniform 0;
    }

    airfoil
    {
        type nutUWallFunction;
        value uniform 0;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}
