airFoil2D/constant/momentumTransport
FoamFile
{
    format ascii;
    class dictionary;
    object momentumTransport;
}

simulationType RAS;

RAS
{
    RASModel        SpalartAllmaras;
    turbulence      on;
    printCoeffs     on;
}
