airFoil2D/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// ---------------------------------------------------------------------
// Vertices (thin extrusion in z)
// ---------------------------------------------------------------------
vertices
(
    (-1 -1.5 -0.01)   // 0
    ( 3 -1.5 -0.01)   // 1
    ( 3  1.5 -0.01)   // 2
    (-1  1.5 -0.01)   // 3
    (-1 -1.5  0.01)   // 4
    ( 3 -1.5  0.01)   // 5
    ( 3  1.5  0.01)   // 6
    (-1  1.5  0.01)   // 7
);

// ---------------------------------------------------------------------
// Single-cell extrusion in z → TRUE 2D mesh
// ---------------------------------------------------------------------
blocks
(
    hex (0 1 2 3 4 5 6 7) (200 100 1) simpleGrading (1 1 1)
);

edges
(
);

// ---------------------------------------------------------------------
// Boundary patches
// ---------------------------------------------------------------------
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }

    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }

    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
