airFoil2D/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name frontAndBack;
        patchInfo
        {
            type empty;
        }
        constructFrom set;
        set frontBackFaces;
    }
);
