airFoil2D/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

surfaces
(
    "airfoil.stl"
);

includedAngle 150;

